Revit 2022 API
Revision.NumberType Property
 Indicates what number type the Revision Number for this Revision should use.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
public RevisionNumberType NumberType { get; set; }
Visual Basic
Public Property NumberType As RevisionNumberType
	Get
	Set
Visual C++
public:
property RevisionNumberType NumberType {
	RevisionNumberType get ();
	void set (RevisionNumberType value);
}
Remarks
 This property defines how the Revision Number (not including any user-specified prefix or suffix) will be assigned and displayed.
RevisionNumberType.Numeric: Revision Numbers will be consecutive integers, starting by default with a value of 1. Alternatively, the starting value can be set to any non-negative value using the NumericRevisionSettings stored in the project-wide RevisionSettings.
RevisionNumberType.Alphabetic: This number type has been replaced by RevisionNumberType.Alphanumeric.
RevisionNumberType.None: The Revision Number will always be the empty string.
RevisionNumberType.Alphanumeric: The Revision Numbers will be taken consecutively from a list of arbitrary strings, specified in the AlphanumericRevisionSettings object stored in the project-wide RevisionSettings.
 Revision numbers will always be assigned in revision sequence order. Any prefixes or suffixes specified in the NumericRevisionSettings and AlphanumericRevisionSettings will be prepended or appended respectively to the Revision Number assigned to the Revision.
 If the project contains a mix of Revision objects with different NumberTypes then the Revisions using a particular NumberType will always be assigned consecutive revision numbers. In other words, the first three numeric Revisions in the project will always be assigned revision numbers 1, 2, and 3, even if the revision sequence includes intervening Revisions that are alphabetic or not numbered.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This operation cannot be performed on Revisions that have already been issued.
See Also
Revision Class
Autodesk.Revit.DB Namespace